virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/supc.h
/* -------- SUPC_PWMR : (SUPC Offset: 0x1C) (R/W 32) Supply Controller Power Mode Register -------- */
#define SUPC_PWMR_LPOWERS_Pos                 _U_(0)                                               /**< (SUPC_PWMR) Low Power Value Selection Position */
#define SUPC_PWMR_LPOWERS_Msk                 (_U_(0x1) << SUPC_PWMR_LPOWERS_Pos)                  /**< (SUPC_PWMR) Low Power Value Selection Mask */
#define SUPC_PWMR_LPOWERS(value)              (SUPC_PWMR_LPOWERS_Msk & ((value) << SUPC_PWMR_LPOWERS_Pos))
#define   SUPC_PWMR_LPOWERS_FACTORY_Val       _U_(0x0)                                             /**< (SUPC_PWMR) The trimming value applied to the regulator when the device is in Wait mode. This value is factory-defined.  */
#define   SUPC_PWMR_LPOWERS_USER_Val          _U_(0x1)                                             /**< (SUPC_PWMR) The trimming value applied to the regulator is defined by the value programmed in the LPOWERx bits.  */
#define SUPC_PWMR_LPOWERS_FACTORY             (SUPC_PWMR_LPOWERS_FACTORY_Val << SUPC_PWMR_LPOWERS_Pos) /**< (SUPC_PWMR) The trimming value applied to the regulator when the device is in Wait mode. This value is factory-defined. Position  */
#define SUPC_PWMR_LPOWERS_USER                (SUPC_PWMR_LPOWERS_USER_Val << SUPC_PWMR_LPOWERS_Pos) /**< (SUPC_PWMR) The trimming value applied to the regulator is defined by the value programmed in the LPOWERx bits. Position  */
#define SUPC_PWMR_LPOWER0_Pos                 _U_(1)                                               /**< (SUPC_PWMR) Low Power Value Position */
#define SUPC_PWMR_LPOWER0_Msk                 (_U_(0x1) << SUPC_PWMR_LPOWER0_Pos)                  /**< (SUPC_PWMR) Low Power Value Mask */
#define SUPC_PWMR_LPOWER0(value)              (SUPC_PWMR_LPOWER0_Msk & ((value) << SUPC_PWMR_LPOWER0_Pos))
#define SUPC_PWMR_LPOWER1_Pos                 _U_(2)                                               /**< (SUPC_PWMR) Low Power Value Position */
#define SUPC_PWMR_LPOWER1_Msk                 (_U_(0x1) << SUPC_PWMR_LPOWER1_Pos)                  /**< (SUPC_PWMR) Low Power Value Mask */
#define SUPC_PWMR_LPOWER1(value)              (SUPC_PWMR_LPOWER1_Msk & ((value) << SUPC_PWMR_LPOWER1_Pos))
#define SUPC_PWMR_LPOWER2_Pos                 _U_(3)                                               /**< (SUPC_PWMR) Low Power Value Position */
#define SUPC_PWMR_LPOWER2_Msk                 (_U_(0x1) << SUPC_PWMR_LPOWER2_Pos)                  /**< (SUPC_PWMR) Low Power Value Mask */
#define SUPC_PWMR_LPOWER2(value)              (SUPC_PWMR_LPOWER2_Msk & ((value) << SUPC_PWMR_LPOWER2_Pos))
#define SUPC_PWMR_LPOWER3_Pos                 _U_(4)                                               /**< (SUPC_PWMR) Low Power Value Position */
#define SUPC_PWMR_LPOWER3_Msk                 (_U_(0x1) << SUPC_PWMR_LPOWER3_Pos)                  /**< (SUPC_PWMR) Low Power Value Mask */
#define SUPC_PWMR_LPOWER3(value)              (SUPC_PWMR_LPOWER3_Msk & ((value) << SUPC_PWMR_LPOWER3_Pos))
#define SUPC_PWMR_STUPTIME_Pos                _U_(7)                                               /**< (SUPC_PWMR) Start-up Time when Resuming from Wait Mode Position */
#define SUPC_PWMR_STUPTIME_Msk                (_U_(0x1) << SUPC_PWMR_STUPTIME_Pos)                 /**< (SUPC_PWMR) Start-up Time when Resuming from Wait Mode Mask */
#define SUPC_PWMR_STUPTIME(value)             (SUPC_PWMR_STUPTIME_Msk & ((value) << SUPC_PWMR_STUPTIME_Pos))
#define   SUPC_PWMR_STUPTIME_FAST_Val         _U_(0x0)                                             /**< (SUPC_PWMR) Fast start-up.  */
#define   SUPC_PWMR_STUPTIME_SLOW_Val         _U_(0x1)                                             /**< (SUPC_PWMR) Slow start-up.  */
#define SUPC_PWMR_STUPTIME_FAST               (SUPC_PWMR_STUPTIME_FAST_Val << SUPC_PWMR_STUPTIME_Pos) /**< (SUPC_PWMR) Fast start-up. Position  */
#define SUPC_PWMR_STUPTIME_SLOW               (SUPC_PWMR_STUPTIME_SLOW_Val << SUPC_PWMR_STUPTIME_Pos) /**< (SUPC_PWMR) Slow start-up. Position  */
#define SUPC_PWMR_ECPWRS_Pos                  _U_(8)                                               /**< (SUPC_PWMR) Enhanced Custom Power Value Selection Position */
#define SUPC_PWMR_ECPWRS_Msk                  (_U_(0x1) << SUPC_PWMR_ECPWRS_Pos)                   /**< (SUPC_PWMR) Enhanced Custom Power Value Selection Mask */
#define SUPC_PWMR_ECPWRS(value)               (SUPC_PWMR_ECPWRS_Msk & ((value) << SUPC_PWMR_ECPWRS_Pos))
#define   SUPC_PWMR_ECPWRS_FACTORY_Val        _U_(0x0)                                             /**< (SUPC_PWMR) The trimming value applied to the regulator when the device is in Active mode. This value is factory-defined.  */
#define   SUPC_PWMR_ECPWRS_USER_Val           _U_(0x1)                                             /**< (SUPC_PWMR) The trimming value applied to the regulator is defined by the value programmed in ECPWRx bits.  */
#define SUPC_PWMR_ECPWRS_FACTORY              (SUPC_PWMR_ECPWRS_FACTORY_Val << SUPC_PWMR_ECPWRS_Pos) /**< (SUPC_PWMR) The trimming value applied to the regulator when the device is in Active mode. This value is factory-defined. Position  */
#define SUPC_PWMR_ECPWRS_USER                 (SUPC_PWMR_ECPWRS_USER_Val << SUPC_PWMR_ECPWRS_Pos)  /**< (SUPC_PWMR) The trimming value applied to the regulator is defined by the value programmed in ECPWRx bits. Position  */
#define SUPC_PWMR_ECPWR0_Pos                  _U_(9)                                               /**< (SUPC_PWMR) Enhanced Custom Power Value Position */
#define SUPC_PWMR_ECPWR0_Msk                  (_U_(0x1) << SUPC_PWMR_ECPWR0_Pos)                   /**< (SUPC_PWMR) Enhanced Custom Power Value Mask */
#define SUPC_PWMR_ECPWR0(value)               (SUPC_PWMR_ECPWR0_Msk & ((value) << SUPC_PWMR_ECPWR0_Pos))
#define SUPC_PWMR_ECPWR1_Pos                  _U_(10)                                              /**< (SUPC_PWMR) Enhanced Custom Power Value Position */
#define SUPC_PWMR_ECPWR1_Msk                  (_U_(0x1) << SUPC_PWMR_ECPWR1_Pos)                   /**< (SUPC_PWMR) Enhanced Custom Power Value Mask */
#define SUPC_PWMR_ECPWR1(value)               (SUPC_PWMR_ECPWR1_Msk & ((value) << SUPC_PWMR_ECPWR1_Pos))
#define SUPC_PWMR_ECPWR2_Pos                  _U_(11)                                              /**< (SUPC_PWMR) Enhanced Custom Power Value Position */
#define SUPC_PWMR_ECPWR2_Msk                  (_U_(0x1) << SUPC_PWMR_ECPWR2_Pos)                   /**< (SUPC_PWMR) Enhanced Custom Power Value Mask */
#define SUPC_PWMR_ECPWR2(value)               (SUPC_PWMR_ECPWR2_Msk & ((value) << SUPC_PWMR_ECPWR2_Pos))
#define SUPC_PWMR_ECPWR3_Pos                  _U_(12)                                              /**< (SUPC_PWMR) Enhanced Custom Power Value Position */
#define SUPC_PWMR_ECPWR3_Msk                  (_U_(0x1) << SUPC_PWMR_ECPWR3_Pos)                   /**< (SUPC_PWMR) Enhanced Custom Power Value Mask */
#define SUPC_PWMR_ECPWR3(value)               (SUPC_PWMR_ECPWR3_Msk & ((value) << SUPC_PWMR_ECPWR3_Pos))
#define SUPC_PWMR_SRAM0ON_Pos                 _U_(16)                                              /**< (SUPC_PWMR) SRAM Power Control Position */
#define SUPC_PWMR_SRAM0ON_Msk                 (_U_(0x1) << SUPC_PWMR_SRAM0ON_Pos)                  /**< (SUPC_PWMR) SRAM Power Control Mask */
#define SUPC_PWMR_SRAM0ON(value)              (SUPC_PWMR_SRAM0ON_Msk & ((value) << SUPC_PWMR_SRAM0ON_Pos))
#define   SUPC_PWMR_SRAM0ON_OFF_Val           _U_(0x0)                                             /**< (SUPC_PWMR) SRAMx is not powered.  */
#define   SUPC_PWMR_SRAM0ON_ON_Val            _U_(0x1)                                             /**< (SUPC_PWMR) SRAMx is powered.  */
#define SUPC_PWMR_SRAM0ON_OFF                 (SUPC_PWMR_SRAM0ON_OFF_Val << SUPC_PWMR_SRAM0ON_Pos) /**< (SUPC_PWMR) SRAMx is not powered. Position  */
#define SUPC_PWMR_SRAM0ON_ON                  (SUPC_PWMR_SRAM0ON_ON_Val << SUPC_PWMR_SRAM0ON_Pos)  /**< (SUPC_PWMR) SRAMx is powered. Position  */
#define SUPC_PWMR_SRAM1ON_Pos                 _U_(17)                                              /**< (SUPC_PWMR) SRAM Power Control Position */
#define SUPC_PWMR_SRAM1ON_Msk                 (_U_(0x1) << SUPC_PWMR_SRAM1ON_Pos)                  /**< (SUPC_PWMR) SRAM Power Control Mask */
#define SUPC_PWMR_SRAM1ON(value)              (SUPC_PWMR_SRAM1ON_Msk & ((value) << SUPC_PWMR_SRAM1ON_Pos))
#define   SUPC_PWMR_SRAM1ON_OFF_Val           _U_(0x0)                                             /**< (SUPC_PWMR) SRAMx is not powered.  */
#define   SUPC_PWMR_SRAM1ON_ON_Val            _U_(0x1)                                             /**< (SUPC_PWMR) SRAMx is powered.  */
#define SUPC_PWMR_SRAM1ON_OFF                 (SUPC_PWMR_SRAM1ON_OFF_Val << SUPC_PWMR_SRAM1ON_Pos) /**< (SUPC_PWMR) SRAMx is not powered. Position  */
#define SUPC_PWMR_SRAM1ON_ON                  (SUPC_PWMR_SRAM1ON_ON_Val << SUPC_PWMR_SRAM1ON_Pos)  /**< (SUPC_PWMR) SRAMx is powered. Position  */
#define SUPC_PWMR_SRAM2ON_Pos                 _U_(18)                                              /**< (SUPC_PWMR) SRAM Power Control Position */
#define SUPC_PWMR_SRAM2ON_Msk                 (_U_(0x1) << SUPC_PWMR_SRAM2ON_Pos)                  /**< (SUPC_PWMR) SRAM Power Control Mask */
#define SUPC_PWMR_SRAM2ON(value)              (SUPC_PWMR_SRAM2ON_Msk & ((value) << SUPC_PWMR_SRAM2ON_Pos))
#define   SUPC_PWMR_SRAM2ON_OFF_Val           _U_(0x0)                                             /**< (SUPC_PWMR) SRAMx is not powered.  */
#define   SUPC_PWMR_SRAM2ON_ON_Val            _U_(0x1)                                             /**< (SUPC_PWMR) SRAMx is powered.  */
#define SUPC_PWMR_SRAM2ON_OFF                 (SUPC_PWMR_SRAM2ON_OFF_Val << SUPC_PWMR_SRAM2ON_Pos) /**< (SUPC_PWMR) SRAMx is not powered. Position  */
#define SUPC_PWMR_SRAM2ON_ON                  (SUPC_PWMR_SRAM2ON_ON_Val << SUPC_PWMR_SRAM2ON_Pos)  /**< (SUPC_PWMR) SRAMx is powered. Position  */
#define SUPC_PWMR_SRAM3ON_Pos                 _U_(19)                                              /**< (SUPC_PWMR) SRAM Power Control Position */
#define SUPC_PWMR_SRAM3ON_Msk                 (_U_(0x1) << SUPC_PWMR_SRAM3ON_Pos)                  /**< (SUPC_PWMR) SRAM Power Control Mask */
#define SUPC_PWMR_SRAM3ON(value)              (SUPC_PWMR_SRAM3ON_Msk & ((value) << SUPC_PWMR_SRAM3ON_Pos))
#define   SUPC_PWMR_SRAM3ON_OFF_Val           _U_(0x0)                                             /**< (SUPC_PWMR) SRAMx is not powered.  */
#define   SUPC_PWMR_SRAM3ON_ON_Val            _U_(0x1)                                             /**< (SUPC_PWMR) SRAMx is powered.  */
#define SUPC_PWMR_SRAM3ON_OFF                 (SUPC_PWMR_SRAM3ON_OFF_Val << SUPC_PWMR_SRAM3ON_Pos) /**< (SUPC_PWMR) SRAMx is not powered. Position  */
#define SUPC_PWMR_SRAM3ON_ON                  (SUPC_PWMR_SRAM3ON_ON_Val << SUPC_PWMR_SRAM3ON_Pos)  /**< (SUPC_PWMR) SRAMx is powered. Position  */
#define SUPC_PWMR_SRAM4ON_Pos                 _U_(20)                                              /**< (SUPC_PWMR) SRAM Power Control Position */
#define SUPC_PWMR_SRAM4ON_Msk                 (_U_(0x1) << SUPC_PWMR_SRAM4ON_Pos)                  /**< (SUPC_PWMR) SRAM Power Control Mask */
#define SUPC_PWMR_SRAM4ON(value)              (SUPC_PWMR_SRAM4ON_Msk & ((value) << SUPC_PWMR_SRAM4ON_Pos))
#define   SUPC_PWMR_SRAM4ON_OFF_Val           _U_(0x0)                                             /**< (SUPC_PWMR) SRAMx is not powered.  */
#define   SUPC_PWMR_SRAM4ON_ON_Val            _U_(0x1)                                             /**< (SUPC_PWMR) SRAMx is powered.  */
#define SUPC_PWMR_SRAM4ON_OFF                 (SUPC_PWMR_SRAM4ON_OFF_Val << SUPC_PWMR_SRAM4ON_Pos) /**< (SUPC_PWMR) SRAMx is not powered. Position  */
#define SUPC_PWMR_SRAM4ON_ON                  (SUPC_PWMR_SRAM4ON_ON_Val << SUPC_PWMR_SRAM4ON_Pos)  /**< (SUPC_PWMR) SRAMx is powered. Position  */
#define SUPC_PWMR_SRAM5ON_Pos                 _U_(21)                                              /**< (SUPC_PWMR) SRAM Power Control Position */
#define SUPC_PWMR_SRAM5ON_Msk                 (_U_(0x1) << SUPC_PWMR_SRAM5ON_Pos)                  /**< (SUPC_PWMR) SRAM Power Control Mask */
#define SUPC_PWMR_SRAM5ON(value)              (SUPC_PWMR_SRAM5ON_Msk & ((value) << SUPC_PWMR_SRAM5ON_Pos))
#define   SUPC_PWMR_SRAM5ON_OFF_Val           _U_(0x0)                                             /**< (SUPC_PWMR) SRAMx is not powered.  */
#define   SUPC_PWMR_SRAM5ON_ON_Val            _U_(0x1)                                             /**< (SUPC_PWMR) SRAMx is powered.  */
#define SUPC_PWMR_SRAM5ON_OFF                 (SUPC_PWMR_SRAM5ON_OFF_Val << SUPC_PWMR_SRAM5ON_Pos) /**< (SUPC_PWMR) SRAMx is not powered. Position  */
#define SUPC_PWMR_SRAM5ON_ON                  (SUPC_PWMR_SRAM5ON_ON_Val << SUPC_PWMR_SRAM5ON_Pos)  /**< (SUPC_PWMR) SRAMx is powered. Position  */
#define SUPC_PWMR_SRAM6ON_Pos                 _U_(22)                                              /**< (SUPC_PWMR) SRAM Power Control Position */
#define SUPC_PWMR_SRAM6ON_Msk                 (_U_(0x1) << SUPC_PWMR_SRAM6ON_Pos)                  /**< (SUPC_PWMR) SRAM Power Control Mask */
#define SUPC_PWMR_SRAM6ON(value)              (SUPC_PWMR_SRAM6ON_Msk & ((value) << SUPC_PWMR_SRAM6ON_Pos))
#define   SUPC_PWMR_SRAM6ON_OFF_Val           _U_(0x0)                                             /**< (SUPC_PWMR) SRAMx is not powered.  */
#define   SUPC_PWMR_SRAM6ON_ON_Val            _U_(0x1)                                             /**< (SUPC_PWMR) SRAMx is powered.  */
#define SUPC_PWMR_SRAM6ON_OFF                 (SUPC_PWMR_SRAM6ON_OFF_Val << SUPC_PWMR_SRAM6ON_Pos) /**< (SUPC_PWMR) SRAMx is not powered. Position  */
#define SUPC_PWMR_SRAM6ON_ON                  (SUPC_PWMR_SRAM6ON_ON_Val << SUPC_PWMR_SRAM6ON_Pos)  /**< (SUPC_PWMR) SRAMx is powered. Position  */
#define SUPC_PWMR_DPRAMON_Pos                 _U_(23)                                              /**< (SUPC_PWMR) Dual-port RAM Power Control Position */
#define SUPC_PWMR_DPRAMON_Msk                 (_U_(0x1) << SUPC_PWMR_DPRAMON_Pos)                  /**< (SUPC_PWMR) Dual-port RAM Power Control Mask */
#define SUPC_PWMR_DPRAMON(value)              (SUPC_PWMR_DPRAMON_Msk & ((value) << SUPC_PWMR_DPRAMON_Pos))
#define   SUPC_PWMR_DPRAMON_OFF_Val           _U_(0x0)                                             /**< (SUPC_PWMR) USB dual-port RAM is not powered.  */
#define   SUPC_PWMR_DPRAMON_ON_Val            _U_(0x1)                                             /**< (SUPC_PWMR) USB dual-port RAM is powered.  */
#define SUPC_PWMR_DPRAMON_OFF                 (SUPC_PWMR_DPRAMON_OFF_Val << SUPC_PWMR_DPRAMON_Pos) /**< (SUPC_PWMR) USB dual-port RAM is not powered. Position  */
#define SUPC_PWMR_DPRAMON_ON                  (SUPC_PWMR_DPRAMON_ON_Val << SUPC_PWMR_DPRAMON_Pos)  /**< (SUPC_PWMR) USB dual-port RAM is powered. Position  */
#define SUPC_PWMR_KEY_Pos                     _U_(24)                                              /**< (SUPC_PWMR) Password Key Position */
#define SUPC_PWMR_KEY_Msk                     (_U_(0xFF) << SUPC_PWMR_KEY_Pos)                     /**< (SUPC_PWMR) Password Key Mask */
#define SUPC_PWMR_KEY(value)                  (SUPC_PWMR_KEY_Msk & ((value) << SUPC_PWMR_KEY_Pos))
#define   SUPC_PWMR_KEY_PASSWD_Val            _U_(0x5A)                                            /**< (SUPC_PWMR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define SUPC_PWMR_KEY_PASSWD                  (SUPC_PWMR_KEY_PASSWD_Val << SUPC_PWMR_KEY_Pos)      /**< (SUPC_PWMR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define SUPC_PWMR_Msk                         _U_(0xFFFF1F9F)                                      /**< (SUPC_PWMR) Register Mask  */

