virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/supc.h
#define SUPC_PWMR_LPOWER_Pos                  _U_(1)                                               /**< (SUPC_PWMR Position) Low Power Value */
#define SUPC_PWMR_LPOWER_Msk                  (_U_(0xF) << SUPC_PWMR_LPOWER_Pos)                   /**< (SUPC_PWMR Mask) LPOWER */
#define SUPC_PWMR_LPOWER(value)               (SUPC_PWMR_LPOWER_Msk & ((value) << SUPC_PWMR_LPOWER_Pos)) 
#define SUPC_PWMR_ECPWR_Pos                   _U_(9)                                               /**< (SUPC_PWMR Position) Enhanced Custom Power Value */
#define SUPC_PWMR_ECPWR_Msk                   (_U_(0xF) << SUPC_PWMR_ECPWR_Pos)                    /**< (SUPC_PWMR Mask) ECPWR */
#define SUPC_PWMR_ECPWR(value)                (SUPC_PWMR_ECPWR_Msk & ((value) << SUPC_PWMR_ECPWR_Pos)) 

/** \brief SUPC register offsets definitions */
#define SUPC_CR_REG_OFST               (0x00)              /**< (SUPC_CR) Supply Controller Control Register Offset */
#define SUPC_SMMR_REG_OFST             (0x04)              /**< (SUPC_SMMR) Supply Controller Supply Monitor Mode Register Offset */
#define SUPC_MR_REG_OFST               (0x08)              /**< (SUPC_MR) Supply Controller Mode Register Offset */
#define SUPC_WUMR_REG_OFST             (0x0C)              /**< (SUPC_WUMR) Supply Controller Wake-up Mode Register Offset */
#define SUPC_WUIR_REG_OFST             (0x10)              /**< (SUPC_WUIR) Supply Controller Wake-up Inputs Register Offset */
#define SUPC_SR_REG_OFST               (0x14)              /**< (SUPC_SR) Supply Controller Status Register Offset */
#define SUPC_PWMR_REG_OFST             (0x1C)              /**< (SUPC_PWMR) Supply Controller Power Mode Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SUPC register API structure */
typedef struct
{
  __O   uint32_t                       SUPC_CR;            /**< Offset: 0x00 ( /W  32) Supply Controller Control Register */
  __IO  uint32_t                       SUPC_SMMR;          /**< Offset: 0x04 (R/W  32) Supply Controller Supply Monitor Mode Register */
  __IO  uint32_t                       SUPC_MR;            /**< Offset: 0x08 (R/W  32) Supply Controller Mode Register */
  __IO  uint32_t                       SUPC_WUMR;          /**< Offset: 0x0C (R/W  32) Supply Controller Wake-up Mode Register */
  __IO  uint32_t                       SUPC_WUIR;          /**< Offset: 0x10 (R/W  32) Supply Controller Wake-up Inputs Register */
  __I   uint32_t                       SUPC_SR;            /**< Offset: 0x14 (R/   32) Supply Controller Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       SUPC_PWMR;          /**< Offset: 0x1C (R/W  32) Supply Controller Power Mode Register */
} supc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMG55_SUPC_COMPONENT_H_ */
